       01 DEMANDE-PRET.
          05 TYPE-PRET         PIC X.
             88 PRET-AUTO                  VALUE 'A'.
             88 PRET-CONSO                 VALUE 'C'.
             88 PRET-IMMO                  VALUE 'I'.
          05 CAPITAL           PIC 9(6)V99.
          05 DUREE-PRET-ANNEE  PIC 99.
